nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw23/demo_apps/power_manager_test/bm/pin_mux.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO0_21 (number 14), BOARD_WAKEUP_GPIO_PIN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOARD_WAKEUP_GPIO_PIN_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BOARD_WAKEUP_GPIO_PIN_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BOARD_WAKEUP_GPIO_PIN_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_BOARD_WAKEUP_GPIO_PIN_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BOARD_WAKEUP_GPIO_PIN_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO0_18 (number 8), BOARD_BUTTON1_GPIO_PIN
  @{ */

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_GPIO GPIO
/*!
 * @brief GPIO pin mask */
#define BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_GPIO_PIN_MASK (1U << 18U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_PIN 18U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_BOARD_BUTTON1_GPIO_PIN_PIN_MASK (1U << 18U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
